tutorials/pbeTransportFoam/TaylorCouette/0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.070;

boundaryField
{   
    "wedge.*"
    {
        type            wedge;
    }
    innerWall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    outerWall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    inlet
    {
        type            symmetry;
    }
    outlet
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
