tutorials/pbeTransportFoam/TaylorCouette/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

mkdir 0 2>&1
cp 0.org/* 0/ 2>&1

cp -f system/controlDict.flow system/controlDict
runApplication blockMesh
runApplication buoyantSimpleFoam

mv 50 50.flow
cp -f 50.flow/* 0/ 2>&1
cp -f system/controlDict.pbe system/controlDict

decomposePar 
mpirun -np 4 pbeTransportFoam -parallel

runApplication reconstructPar -latestTime

# ----------------------------------------------------------------- end-of-file
