tutorials/pbeTransportFoam/TaylorCouette/constant/populationBalanceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      populationaBalanceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

populationBalanceModel univariatePopulationBalance;

univariatePopulationBalanceCoeffs
{
    aggregation on;
    
    aggregationKernel
    {
        aggregationKernel sum;
        
        df                  2.0;
        lambdaf lambdaf     [ 0 1 0 0 0 0 0 ] 3.968e-6;
        abscissa0  abscissa0  [ 0 3 0 0 0 0 0 ] 4.2667e-8;
    }
    
    breakup on;
    
    breakupKernel
    {
        breakupKernel constant;
        
        Cb        Cb        [ 0 0 -1 0 0 0 0 ] 1.0e-3;
        epsilonExp          0.75;
        nuExp              -1.25;
        sizeExp             1.0;
    }
    
    daughterDistribution
    {
        daughterDistribution symmetricFragmentation;
    }
    
    diffusionModel
    {
        diffusionModel  turbulentDiffusion;
        gammaLam        gammaLam    [ 0 2 -1 0 0 0 0 ] 0.0001;
        Sc              0.7;
    }
    
    growth off;

    growthModel
    {
        growthModel constant;

        Cg        Cg        [0 3 -1 0 0 0 0 ] 1.0;
    }
    
    nucleation off;
    
    nucleationModel
    {
        nucleationModel noNucleation;
        
        nCarbonPAM          16;
        nCarbonDimer        32;
        rhoSoot rhoSoot     [ 1 -3 0 0 0 0 0 ] 1800.0;
    }
}


// ************************************************************************* //
